In [2]:
import pandas as pd

In [83]:
# Data structure: Two-dimensional, size-mutable, potentially heterogeneous tabular data.

# class pandas.Series(data=None, index=None, dtype=None, name=None, copy=None, fastpath=<no_default>)
# class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)
# pivot table: reshaping the data into a table format

# pivot(): Does not handle duplicate values in the index/column combination.
# pivot_table(): Handles duplicates by providing an option to aggregate (using aggfunc) when duplicates are present.
# Use apply() when you need more flexibility in applying custom functions that could return aggregated data, reshape data, or reduce the data in any way.

# Use transform() when you want an element-wise transformation that does not change the shape of your data, such as standardizing, scaling, 
# or filling missing values.

# `merge()` is used to combine two DataFrames based on the values of common columns or indices. It works similarly to SQL joins 
# (e.g., inner, outer, left, right).

# `join()` is similar to `merge()` but is used when you want to join based on indices (rather than column values). 
# You can also use it to join on a specific column.

# `concat()` is used to concatenate DataFrames along rows or columns (axis 0 or axis 1). 
# This is useful when you want to stack DataFrames vertically or horizontally.

# 1. **Forward Fill (`ffill`)**: Fills missing values with the last valid observation.                      df.fillna(method='ffill')
# 2. **Backward Fill (`bfill`)**: Fills missing values with the next valid observation.                     df.fillna(method='bfill')
# 3. **Fill with a constant value** (e.g., 0): Replaces all missing values with a specified constant.       df.fillna(0)
# 4. **Fill with the mean of the column**: Replaces missing values with the mean of the respective column.  df.fillna(df.mean())

```py
pd.read_csv(
    filepath_or_buffer,  # Path to the file or buffer
    sep=',',  # Delimiter between columns
    header='infer',  # Row(s) to use as column names
    names=None,  # List of column names to use
    index_col=None,  # Column(s) to set as the index
    usecols=None,  # Columns to read from the file
    dtype=None,  # Data type for each column
    engine='c',  # Parser engine to use ('c' or 'python')
    skiprows=None,  # Number of rows or indices to skip
    na_values=None,  # Additional strings to recognize as NA
    nrows=None,  # Number of rows to read
    encoding=None,  # File encoding
    parse_dates=False,  # Columns to parse as dates
    skip_blank_lines=True,  # Whether to skip blank lines
    converters=None,  # Functions to convert column values
    quoting=0  # Quote handling (default is minimal)
)
```

### 1. **Merge**
`merge()` is used to combine two DataFrames based on the values of common columns or indices. It works similarly to SQL joins (e.g., inner, outer, left, right).

Example:
```python
import pandas as pd

df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['A', 'B', 'C']})
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Age': [21, 22, 23]})

result = pd.merge(df1, df2, on='ID', how='inner')  # 'inner', 'outer', 'left', or 'right'
print(result)
```

- **on**: The column name to join on.
- **how**: Type of join (`'left'`, `'right'`, `'outer'`, `'inner'`).

In [3]:
import pandas as pd

df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['A', 'B', 'C']})
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Age': [21, 22, 23]})

result = pd.merge(df1, df2, on='ID', how='inner')  # 'inner', 'outer', 'left', or 'right'
print(result)

   ID Name  Age
0   1    A   21
1   2    B   22

### 2. **Join**
`join()` is similar to `merge()` but is used when you want to join based on indices (rather than column values). You can also use it to join on a specific column.

Example:
```python
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['A', 'B', 'C']})
df2 = pd.DataFrame({'Age': [21, 22, 23]}, index=[1, 2, 3])

result = df1.join(df2)
print(result)
```

- **left**: Left DataFrame.
- **right**: Right DataFrame.
- By default, it performs a left join on the index.

In [4]:
# By default it perform left join
import pandas as pd
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['A', 'B', 'C']})
df2 = pd.DataFrame({'Age': [21, 22, 23]}, index=[1, 2, 3])

result = df1.join(df2)
print(result)

   ID Name   Age
0   1    A   NaN
1   2    B  21.0
2   3    C  22.0


### 3. **Concat**
`concat()` is used to concatenate DataFrames along rows or columns (axis 0 or axis 1). This is useful when you want to stack DataFrames vertically or horizontally.

Example (vertical concatenation):
```python
df1 = pd.DataFrame({'Name': ['A', 'B'], 'Age': [21, 22]})
df2 = pd.DataFrame({'Name': ['C', 'D'], 'Age': [23, 24]})

result = pd.concat([df1, df2], axis=0, ignore_index=True)
print(result)
```

Example (horizontal concatenation):
```python
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['A', 'B']})
df2 = pd.DataFrame({'Age': [21, 22]})

result = pd.concat([df1, df2], axis=1)
print(result)
```

- **axis=0**: Concatenates along rows (vertical stacking).
- **axis=1**: Concatenates along columns (side-by-side).
- **ignore_index=True**: Resets the index after concatenation.

### Summary:
- **`merge()`**: SQL-style join based on columns or index.
- **`join()`**: Join based on index (with optional column-based joining).
- **`concat()`**: Stack DataFrames vertically or horizontally.

In [12]:
df1 = pd.DataFrame({'Name': ['A', 'B'], 'Age': [21, 22]})
df2 = pd.DataFrame({'Name': ['C', 'D'], 'Age': [23, 24]})

result = pd.concat([df1, df2], axis=0, ignore_index=True)
print(df1)
print()
print(df2)
print()
print(result)

  Name  Age
0    A   21
1    B   22

  Name  Age
0    C   23
1    D   24

  Name  Age
0    A   21
1    B   22
2    C   23
3    D   24

In [11]:
df1 = pd.DataFrame({'Name': ['A', 'B'], 'Age': [21, 22]})
df2 = pd.DataFrame({'Name': ['C', 'D'], 'Age': [23, 24]})

result = pd.concat([df1, df2], axis=1, ignore_index=True)
print(df1)
print()
print(df2)
print()
print(result)

  Name  Age
0    A   21
1    B   22

  Name  Age
0    C   23
1    D   24

   0   1  2   3
0  A  21  C  23
1  B  22  D  24

In [3]:

# Practice Problems for Part 1

# 1. Create a Pandas Series from a list of numbers from 1 to 10 and print the Series.

import numpy as np 
import pandas as pd 

df = pd.DataFrame({'a':1,'b':2},index=[1,2])
df

   a  b
1  1  2
2  1  2

In [ ]:
import pandas as pd

# List data, specifying dtype and name
data = [1, 2, 3, 4, 5]
series1 = pd.Series(data, dtype='int64', name="Numbers1")
series2 = pd.Series(data, dtype='int64', name="Numbers2")

df = pd.DataFrame([series1,series2], index = range(len(series1))) # ValueError: Length of values (2) does not match length of index (5)

In [39]:
marks = [5,10,15,20,15]
pd.Series(data=marks, name="Marks")

0     5
1    10
2    15
3    20
4    15
Name: Marks, dtype: int64

In [35]:
grades = ["A","B","C"]
pd.Series(data=grades, name="student_grades")

0    A
1    B
2    C
Name: student_grades, dtype: object

In [43]:
marks = [5,10,15,20,15]
grades = ["A","B","C"]
series1 = pd.Series(data=marks, name="Marks")
series2 = pd.Series(data=grades, name="student_grades")

df = pd.DataFrame(data=[series1,series2])
df.values

array([[5, 10, 15, 20.0, 15.0],
       ['A', 'B', 'C', nan, nan]], dtype=object)

In [8]:
# The index parameter is used to define the labels for the rows in the DataFrame.
# The columns parameter is used to define the labels for the columns in the DataFrame.

# When you pass a list of Series objects ([series1, series2]) to the DataFrame constructor, each Series becomes a row in the DataFrame by default.
import pandas as pd

# List data, specifying dtype and name
data = [1, 2, 3, 4, 5]
data1 = ['a','b','c','d','e']
series1 = pd.Series(data1)#, name="Numbers1")
series2 = pd.Series(data1)#, name="Numbers2")

# Creating DataFrame with 2 rows and matching index
df = pd.DataFrame([series1, series2])

print(df)

   0  1  2  3  4
0  a  b  c  d  e
1  a  b  c  d  e

In [79]:
# If you want the data to appear vertically with custom column names, you can specify the columns parameter when creating the DataFrame:
import pandas as pd

# Data for two series
data1 = [1, 2, 3, 4, 5]
data2 = [6, 7, 8, 9, 10]

# Create two Series
series1 = pd.Series(data1)
series2 = pd.Series(data2)

# Create DataFrame with custom column names
df = pd.DataFrame([series1, series2], columns=['A', 'B'])

print(df)

    A   B
0 NaN NaN
1 NaN NaN

In [80]:
import pandas as pd

# Data for two series
data1 = [1, 2, 3, 4, 5]
data2 = [6, 7, 8, 9, 10]

# Create DataFrame with custom column names
df = pd.DataFrame({'A': data1, 'B': data2})

print(df)

# DataFrame
#   |   |   |   |   |
#------------------------
#   |   series1
#   |   series2
#   |   series2
#   |   series3

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [ ]:
# pd.DataFrame([series1, series2], columns=['A', 'B', 'C', 'D', 'E']):

# Here, you're passing a list of Series objects ([series1, series2]) to the pd.DataFrame constructor.

# The columns parameter specifies the column names for the DataFrame.

# However, the pd.DataFrame constructor interprets the list of Series as rows, not columns. 
# This means it tries to create a DataFrame where each Series is a row, and the columns are labeled as ['A', 'B', 'C', 'D', 'E'].


# Mismatch in Dimensions:

# Each Series (series1 and series2) has 5 elements, but the columns parameter specifies 5 column names.

# Since the Series are being treated as rows, the constructor tries to align the Series indices with the column names. Since there's no direct alignment, it fills the DataFrame with NaN (Not a Number) values.

In [75]:
import pandas as pd

# List of data
data = [100, 200, 300]

# Specifying index and name
# index = ['X', 'Y', 'Z']
series = pd.Series(data, index=['X', 'Y', 'Z'], name="Values")

# Print the Series
print(series)

X    100
Y    200
Z    300
Name: Values, dtype: int64

In [48]:
import pandas as pd

# Create some data
data = {'A': [1, 4, 7], 'B': [2, 5, 8], 'C': [3, 6, 9]}

# Specify the index and columns
index = ['Row1', 'Row2', 'Row3']
columns = ['A', 'B', 'C']

# Create DataFrame
df = pd.DataFrame(data, index=index, columns=columns)

print(df)

      A  B  C
Row1  1  2  3
Row2  4  5  6
Row3  7  8  9

In [92]:
df = pd.DataFrame({'A':[1,2,3],'B':[4,5,6],"C":[7,8,9]})

df1 = pd.DataFrame(df.values,columns=['A',"B","C"])
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [13]:
# 2. Create a Pandas DataFrame from a dictionary with keys 'Name', 'Age', and 'Gender', and add at least three records. Print the DataFrame.

import pandas as pd

d = {
        "Name":["Alice","John","Sagar"],
        "Age":[10,11,12],
        "Gender":["Male","Male","Male"]
    }

pd.DataFrame(d)

    Name  Age Gender
0  Alice   10   Male
1   John   11   Male
2  Sagar   12   Male

In [ ]:
# 3. Load a CSV file into a Pandas DataFrame and print the first 5 rows.
# Assuming 'data.csv' is present in the same directory.

# df = pd.read_csv("data.csv")
# df.head(5)

In [44]:
# 4. Identify and count missing values in a given DataFrame.
import numpy as np
df = pd.DataFrame(
    {
        "Name": ["A",np.nan,"C","D",np.nan,"F"],
        "Age":[np.nan, 2, 3, np.nan, 5,6],

    }
)

df.isna().sum()

Name    2
Age     2
dtype: int64

In [45]:
len(df)

6

In [46]:
# 5. Drop columns from a DataFrame where more than 50% of the values are missing.

df.dropna(axis=1, thresh=len(df) * 0.5 , inplace=True)

In [47]:
df

  Name  Age
0    A  NaN
1  NaN  2.0
2    C  3.0
3    D  NaN
4  NaN  5.0
5    F  6.0

In [49]:
# 6. Add a new column to a DataFrame by performing arithmetic operations on existing columns.

df["New_Age"] = df["Age"] + 2
df["New_Age"]

0     NaN
1     6.0
2     7.0
3     NaN
4     9.0
5    10.0
Name: New_Age, dtype: float64

In [59]:
# Part 2

import pandas as pd

# create data.csv
data = {'Company': ['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 124, 243, 350]
        }

df = pd.DataFrame(data)
df.to_csv("data.csv")

In [63]:
# 1. Load a CSV file into a DataFrame and print the first 10 rows
csv = pd.read_csv("data.csv",index_col=["Unnamed: 0"])
csv

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [65]:
# 2. Inspect the DataFrame to find out how many missing values are present in each column.
csv.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 192.0+ bytes

In [66]:
# 3. Fill the missing values in the DataFrame with the mean of their respective columns.

# df.fillna(df.mean())

In [67]:
# 4. Merge two DataFrames on a common key and print the result.

df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value2': [5, 6, 7, 8]})

pd.merge(df1,df2,on="key",how="inner")

  key  value1  value2
0   A       1       5
1   B       2       6
2   C       3       7
3   D       4       8

In [71]:
# 5. Concatenate two DataFrames along the columns and print the result.

pd.concat([df1,df2],axis=0)

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     NaN
2   C     3.0     NaN
3   D     4.0     NaN
0   A     NaN     5.0
1   B     NaN     6.0
2   C     NaN     7.0
3   D     NaN     8.0

In [79]:
# part 3

# 1. Create a DataFrame and group the data by a specific column. Apply aggregate functions like sum and mean to the groups.

data = pd.DataFrame({
    "empid":[1,2,3,4,5,6],
    "ename":["A","B","C","D","E","F"],
    "salary":[3000,1500,2500,2700,2300,3100],
    "dept":["bba","cs","bba","ai","ai","cs"],
    
})

data.groupby("dept")["salary"].sum()

dept
ai     5000
bba    5500
cs     4600
Name: salary, dtype: int64

In [81]:
# 2. Create a pivot table from a DataFrame with multiple aggregation functions.

data.pivot_table(index="empid",columns="dept",values="salary",aggfunc="sum").fillna(0)

dept       ai     bba      cs
empid
1         0.0  3000.0     0.0
2         0.0     0.0  1500.0
3         0.0  2500.0     0.0
4      2700.0     0.0     0.0
5      2300.0     0.0     0.0
6         0.0     0.0  3100.0

In [84]:
# 4. Create a time series DataFrame and resample the data. Fill missing values in the time series.

time_series = pd.date_range(start="2025-01-01",end="2025-05-13")
time_series

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10',
               ...
               '2025-05-04', '2025-05-05', '2025-05-06', '2025-05-07',
               '2025-05-08', '2025-05-09', '2025-05-10', '2025-05-11',
               '2025-05-12', '2025-05-13'],
              dtype='datetime64[ns]', length=133, freq='D')